/* 
  Localizable.strings (Português)
  CleanMacForFlutters
*/

// MARK: - Home View
"home.title" = "Clean Mac for Flutter";
"home.select_folders" = "Selecionar pastas";
"home.empty_folders_message" = "Selecione uma ou mais pastas para exibir.";
"home.run_clean" = "Run clean";
"home.clean_build_index" = "Limpar compilação e índice";
"home.github" = "Github";
"home.support" = "Apoiar";

// MARK: - Full Disk Access
"fda.required_title" = "Acesso total ao disco necessário";
"fda.required_description" = "Para que o app funcione corretamente e consiga limpar as pastas dos projetos, conceda Acesso total ao disco nas Configurações do sistema.";
"fda.open_settings" = "Abrir Configurações de Privacidade";
"fda.try_again" = "Tentar novamente";
"fda.checking_permissions" = "Verificando permissões…";
"fda.instructions" = "Caminho: Ajustes do sistema > Privacidade e Segurança > Acesso total ao disco\nAdicione seu app à lista e marque como ativo.";

// MARK: - Commands
"commands.executing" = "Executando comandos...";
"commands.processing_folder" = "Processando: %@";
"clean.no.activated" = "Sem pasta para limpar";

// MARK: - Alerts
"alert.error" = "Erro";
"alert.success" = "Sucesso";
"alert.ok" = "OK";

// MARK: - Icons/Labels
"icon.folder" = "pasta";
"icon.lock" = "bloqueio";

// MARK: - Clean Commands
"clean.no.activated" = "Nenhuma pasta ativada para limpar";
"clean.completed.title" = "Limpeza concluída!";
"clean.completed.summary" = "✅ Pastas deletadas: %d";
"clean.completed.space" = "💾 Espaço liberado: %@";
"clean.completed.warnings" = "⚠️ Avisos: %d";
"clean.none.deleted.errors" = "Nenhuma pasta foi deletada, mas ocorreram %d erros.";
"clean.nothing.found" = "Nenhuma pasta para limpar foi encontrada.";

// MARK: - Build & Index Clean
"build.index.processing" = "Limpando DerivedData e Index...";
"build.index.completed.title" = "Dados de compilação e índice removidos!";
"build.index.nothing.found" = "Nenhum dado de compilação ou índice encontrado.";
"build.index.select.confirm" = "Confirmar";
"build.index.select.message" = "Selecione a pasta Xcode para limpar DerivedData e Index.\nCaminho padrão: ~/Library/Developer/Xcode";
"build.index.confirm.title" = "Confirmar limpeza";
"build.index.confirm.message" = "Deseja apagar os dados de compilação e índice do Xcode?\n\nEspaço a ser liberado: %@";
"build.index.confirm.delete" = "Apagar";
"build.index.confirm.cancel" = "Cancelar";
